Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/legal_implications_of_a_broken_engagement.html.txt.tmx
Source language: en
Languages: ga

source: Legal implications of a broken engagement
ga: Na himpleachtaí dlíthiúla a bhaineann le gealltanais bhriste

source: Most couples get engaged to marry before they actually get married
ga: Tá sé de nós ag daoine a bheith geallta sula bpósann siad a chéile

source: At one time, such an agreement to marry was considered a legally binding contract and if the engagement was broken without lawful justification, the person responsible could be sued for damages for breach of promise
ga: Má bhristí na gealltanais gan aon bhonn cirt bheith leis, bhíodh an té ba chúis leis faoi dhliteanas agus d'fhéadtaí agra le haghaidh damáistí a dhéanamh ina leith de bharr sárú gealltanais

source: The Family Law Act 1981 abolished legal action for breach of promise but it allows for legal action where there is a dispute over property or finances between a couple following a broken engagement or involving a third party
ga: Chealaigh An tAcht um an Dlí Teaghlaigh 1981 caingne le haghaidh sárú gealltanais ach ceadófar caingean i gcás a bhfuil aighneas ann idir an lánúin mar gheall ar mhaoin nó airgead nó mar gheall ar thríú páirtí

source: It should be noted that the rules described here relate to engaged couples; co-habitation in itself does not necessarily mean that they are engaged to marry
ga: Tagraíonn na rialacha seo do lánúineacha geallta, ní hionann an lánúin bheith ina gcónaí le chéile agus iad bheith geallta dá chéile

source: Gifts between an engaged couple
ga: Brontannais idir an lánúin féin

source: When 2 people who are engaged give gifts (including an engagement ring) to each other, there is a presumption that they are given on the condition that the gifts will be returned (if requested to), should the engagement end
ga: I gcás beirt atá geallta agus a thugann brontannais (fáinne gealltanais san áireamh) dá chéile bíonn toimhde ann gur tugadh na brontannais leis an gcoinníoll go dtabharfaí ar ais iad (má iarrtar orthu) má thagann deireadh leis an ngealtannas

source: If one of the engaged couple dies, however, it is presumed the gifts the deceased gave were given without any conditions
ga: Má fhaigheann duine den lánúin bás áfach, glacfar leis gur thug an duine básaithe na brontannais gan aon choinníollacha bheith ag baint leo

source: So, the surviving fiancé(e) can keep the gifts
ga: Dá bhrí sin, tig leis an duine marthanach den lánúin na brontannais a choinneáil

source: It is possible to contest either of these presumptions in court if there is evidence to the contrary
ga: Is féidir cur in aghaidh ceachtar de na toimhdí seo i gcúirt má tá fianaise á mbréagnú

source: These presumptions only apply to gifts given during the engagement and does not apply to gifts given before or after the engagement
ga: Níl na toimhdí seo i bhfeidhm ach maidir le brontannais a tugadh le linn an ghealltanais agus níl maidir le brontannais a tugadh roimhe nó ina dhiaidh

source: Gifts from a third party
ga: Brontannais ón tríú páirtí

source: Where someone gives an engaged couple or one of the couple a wedding gift, there is a presumption (unless there is evidence to the contrary), that it is given to both of them as joint owners
ga: Má thugann duine brontannas don bheirt atá geallta nó do dhuine acu toimhdítear (mura bhfuil aon fhianaise ina aghaidh), gur tugadh dóibh é mar chomhúinéirí

source: It is also presumed that the gift will be returned (if requested to), should the engagement end and the marriage does not take place for any reason
ga: Toimhdítear freisin go dtabharfar ar ais na brontannais (má iarrtar orthu) má thagann deireadh leis an ngealltanas agus nach dtéann an bhainis ar aghaidh ar aon chúis

source: This includes the death of one of the engaged couple
ga: Tá sé seo i bhfeidhm freisin i gcás bhás duine den lánúin gheallta

source: A third party can also apply to the courts where one of a couple to a broken engagement received a substantial benefit (not a wedding gift) from the third party as a result of the engagement
ga: Tig leis an tríú páirtí dul chun na cúirte nuair a fuair duine den lánúin a bhí geallta buntáiste substaintiúil (ní brontannas bainise) ón tríú páirtí de bharr an ghealltanais

source: For example, if a relative of one of the couple carried out or paid for substantial work to improve a property which the couple intended to use as the family home, the relative can apply to the courts for compensation
ga: Is féidir le duine gaolmhar mar shampla a d'íoc as aon mhórobair le caoi a chur ar theach clainne na beirte cur isteach ar chúiteamh i gcúirt

source: Expenditure on preparations for marriage
ga: Caiteachas ar ullmhúcháin don phósadh

source: Where an engagement has ended and one of the couple has incurred substantial expenses in preparation for the marriage (and hasn't benefited from the expenses), that person may apply to the courts for compensation from their ex-fiancé(e)
ga: Nuair a thagann deireadh le gealltanas agus duine den lánúin tar éis cuid mhór airgead a chaitheamh ag ullmhú don bhainis (agus gan aon bhúntaiste a bheith faighte aige/aici as an gcaiteachas), tig leis an duine sin dul chun na cúirte ag lorg cúitimh

source: One example might be expenses incurred in booking the wedding reception, honeymoon and photographer
ga: (Costais a bhaineann le socruithe bainise, mí na meala, grianghrafadóir srl, mar shampla)

source: A third party (for example, a family member or friend) who incurs expenditure on behalf of one of the couple in preparation for the marriage and has not benefited, may also apply to the courts for compensation
ga: Tig leis an tríú páirtí (duine dá m(h)uintir nó cara, mar shampla) a chaitheann airgead ar son duine den bheirt atá geallta agus gan aon bhuntáiste a bheith faighte acu cur isteach ar chúiteamh

source: Property of engaged couples
ga: Maoin na ndaoine atá geallta

source: Under Section 44 of the Family Law (Divorce) Act 1996 disputes about property between a couple whose engagement has ended are treated in the same way as disputes between a married couple who are separating or divorcing
ga: De réir Alt 44 An tAcht um an Dlí Teaghlaigh (Colscaradh) 1996 caitear le haighnis mhaoine idir lánúin a bhfuil deireadh tagtha lena ngealltanas ar an mbealach céanna le haighnis idir lánúin phósta atá ag (col)scaradh óna chéile

source: This only applies to property in which either or both of them had a beneficial interest while they were engaged
ga: Caithfear aon chaingean a thabhairt laistigh de thrí bliana i ndiaidh deireadh bheith tagtha leis an ngealltanas

source: It does not apply to property acquired after the engagement ended
ga: (Cuirfear seo i bhfeidhm má tá an mhaoin an-luachmhar)

source: Legal action must be taken within 3 years of the engagement ending
ga: Caithfear aon chaingean a thabhairt laistigh de 3 bliana i ndiaidh deireadh bheith tagtha leis an ngealltanas

source: Such actions are generally taken in the Circuit Court but if very valuable property is involved, a party to the proceedings may ask that it be heard in the High Court
ga: De ghnáth tugtar caingne mar seo chun cúirte sa Chúirt Chuarda ach sa gcás go bhfuil an-luach ag baint leis an maoin atá i gceist tig le duine atá ina p(h)áirtí sna himeachtaí dlíthiúla iarraidh go gcloisfear an cás san Ardchúirt

source: Contact a solicitor who will provide you with advice
ga: Téigh i dteagmháil le haturnae a chuirfidh comhairle ort

source: Contact information for solicitors' firms throughout Ireland is available from the Law Society
ga: Sonraí teagmhála do chuideachtaí aturnaetha ar fud na hÉireann le fáil ó Dhlí-Chumann na hÉireann

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Eagraíocht dheonach is ea an ISD (Ionaid Saorchúnaimh Dhlí) a fheidhmíonn mar ghréasán náisiúnta le clinicí comhairle dlí ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Clinicí iontaofa, saor in aisce do chách is ea iad seo

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Téigh i dteagmháil leis an Ionad Eolais do Shaoránaigh is giorra duit chun eolas a fháil maidir leis na seirbhísí ISD atá le fáil i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ritheann ISD freisin eolas agus ar líne a atreorú le linn uaireanta oifige ar fhaisnéis bhunúsach dlí

source: FLAC has produced a series of basic leaflets on various areas of law which may be useful
ga: Tá ISD tar éis sraith de bhileoga bunúsach ar réimsí éagsúla den dlí a d'fhéadfadh a bheith úsáideach

source: These are available from your local Citizens Information Centre and from FLAC or can be downloaded from the FLAC website
ga: Tá siad seo ar fáil ó d'Ionad Faisnéise do Shaoránaigh áitiúil agus ó ISD nó is féidir iad a íoslódáil ó láithreán gréasáin ISD

source: To find out if you are eligible for legal aid you should contact:
ga: Chun fáil amach an bhfuil tú i dteideal cúnaimh dhlí, téigh i dteagmháil le:

source: The Legal Aid Board
ga: An Bord um Chúnamh Dlíthiúil

source: The Legal Aid service operates out of law centres staffed by qualified solicitors
ga: Feidhmíonn and tSeirbhís Chúnaimh Dhlithiúil as ionaid dlí a bhfuil atumaetha cáilithe ag obair iontu
